# parameters
nc: 80  # number of classes
depth_multiple: 0.33  #model depth multiple
width_multiple: 0.50  # layer channel multiple
backbone_width_multiple: 1.0

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, GhostBottleneck, [3, 16, 16, 0, 1]], 
   [-1, 1, GhostBottleneck, [3, 48, 24, 0, 2]], # 2-P2/4
   [-1, 1, GhostBottleneck, [3, 72, 24, 0, 1]],
   [-1, 1, GhostBottleneck, [5, 72, 40, 0.25, 2]], # 4-P3/8
   [-1, 1, GhostBottleneck, [5, 120, 40, 0.25, 1]],
   [-1, 1, GhostBottleneck, [3, 240, 80, 0, 2]], # 6-P4/16
   [-1, 1, GhostBottleneck, [3, 200, 80, 0, 1]],
   [-1, 1, GhostBottleneck, [3, 184, 80, 0, 1]],
   [-1, 1, GhostBottleneck, [3, 184, 80, 0, 1]],
   [-1, 1, GhostBottleneck, [3, 480, 112, 0.25, 1]],
   [-1, 1, GhostBottleneck, [3, 672, 112, 0.25, 1]],
   [-1, 1, GhostBottleneck, [5, 672, 160, 0.25, 2]], # 12-P5/32
   [-1, 1, GhostBottleneck, [5, 960, 160, 0.0, 1]], 
   [-1, 1, GhostBottleneck, [5, 960, 160, 0.25, 1]],
   [-1, 1, GhostBottleneck, [5, 960, 160, 0.0, 1]],
   [-1, 1, GhostBottleneck, [5, 960, 160, 0.25, 1]], 
   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, 3, 1]],  # 19
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, BottleneckCSP, [512, False]],  # 23

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 24], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 33 (P5/32-large)

   [[27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
