# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbone_width_multiple: 1.0

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args] # k t c SE HS s
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, InvertedResidualv3, [3, 1, 16, 1, 0, 2]], # 1-P2/4, 16
   [-1, 1, InvertedResidualv3, [3, 4.5, 24, 0, 0, 2]], # 2-P3/8, 24
   [-1, 1, InvertedResidualv3, [3, 3.67, 24, 0, 0, 1]],     
   [-1, 1, InvertedResidualv3, [5, 4, 40, 1, 1, 2]], # 4-P4/16, 40    
   [-1, 1, InvertedResidualv3, [5, 6, 40, 1, 1, 1]],     
   [-1, 1, InvertedResidualv3, [5, 6, 40, 1, 1, 1]],     
   [-1, 1, InvertedResidualv3, [5, 3, 48, 1, 1, 1]],     
   [-1, 1, InvertedResidualv3, [5, 3, 48, 1, 1, 1]],     
   [-1, 1, InvertedResidualv3, [5, 6, 96, 1, 1, 2]], # 9-P5/32, 96   
   [-1, 1, InvertedResidualv3, [5, 6, 96, 1, 1, 1]],     
   [-1, 1, InvertedResidualv3, [5, 6, 96, 1, 1, 1]],     
   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 14
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, BottleneckCSP, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 25 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 28 (P5/32-large)

   [[22, 25, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
