# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbone_width_multiple: 1.0
backbone_depth_multiple: 1.0

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args] # t, c, n, s, k
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, MBConv, [1, 16, 1, 1, 3]],
   [-1, 1, MBConv, [6, 24, 2, 2, 3]], # 2-P3/4
   [-1, 1, MBConv, [6, 40, 2, 2, 5]], # 3-P4/8
   [-1, 1, MBConv, [6, 80, 3, 2, 3]], # 4-P5/16
   [-1, 1, MBConv, [6, 112, 3, 1, 5]],
   [-1, 1, MBConv, [6, 192, 4, 2, 5]], # 6-P6/32, 16
   [-1, 1, MBConv, [6, 320, 1, 1, 3]],
   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 10
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, BottleneckCSP, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 21 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 24 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
