# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
backbone_width_multiple: 1.0
backbone_depth_multiple: 1.1

# anchors
anchors:
  - [8.2,20.3, 10.5, 28.2, 14.6, 22.2]  # P3/8
  - [13.5,37.0, 21.7, 33.2, 17.8, 46.9]  # P4/16
  - [21.6,63.1, 27.3, 50.7, 26.9, 72.8]  # P5/32
  - [35.1,67.7, 33.3, 89.4, 47.0, 80.4]  # P6/64
  - [42.5,109.4, 59.5, 119.4, 79.3, 153.2]  # P7/128

# EfficientNet B0 backbone
backbone:
  # [from, number, module, args] # k t c SE HS s
  # MBConv [expand_ratio, channels, n_repeats, strides, kernel_size] # t, c, n, s, k
  [[-1, 1, Conv, [32, 3, 2]],  # 0-P1/2 / Stage 1
   [-1, 1, MBConv, [1, 16, 1, 1, 3]], # 1 / Stage 2
   [-1, 1, MBConv, [6, 24, 2, 2, 3]], # 2-P2/4 / Stage 3
   [-1, 1, MBConv, [6, 40, 2, 2, 5]], # 3-P3/8 / Stage 4
   [-1, 1, MBConv, [6, 80, 3, 2, 3]], # 4-P4/16 / Stage 5
   [-1, 1, MBConv, [6, 112, 3, 1, 5]], # 5 / Stage 6
   [-1, 1, MBConv, [6, 192, 4, 2, 5]], # 6-P5/32 / Stage 7
   [-1, 1, MBConv, [6, 320, 1, 1, 3]], # 7 / Stage 8
  ]

# YOLOv5 head
head:
  [
   [[3, 5, 7], 1, BiFPNLayer, [4, 88],
   [8, 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6, P7)
  ]
  